[
  {
    "id": 1,
    "user_id": 1,
    "job_id": 1,
    "status": "applied",
    "applied_at": "2025-01-01T15:30:00Z",
    "updated_at": "2025-01-01T15:30:00Z",
    "cover_letter": "Dear Hiring Manager,\n\nI am excited to apply for the Senior Full Stack Developer position at TechCorp Solutions. With 2 years of experience in full stack development and expertise in React, Node.js, and cloud platforms, I am confident I can contribute to your team's success.\n\nMy experience includes building scalable web applications, working with modern JavaScript frameworks, and deploying applications on AWS. I am passionate about creating efficient, user-friendly solutions and collaborating with cross-functional teams.\n\nI would welcome the opportunity to discuss how my skills and enthusiasm can benefit TechCorp Solutions.\n\nBest regards,\nDemo User",
    "follow_up_date": "2025-01-08T15:30:00Z",
    "score": 85.5,
    "portal_response": "Application submitted successfully",
    "auto_applied": false,
    "notes": "High priority application - good company match"
  },
  {
    "id": 2,
    "user_id": 2,
    "job_id": 4,
    "status": "interview",
    "applied_at": "2024-12-30T09:45:00Z",
    "updated_at": "2025-01-01T14:20:00Z",
    "cover_letter": "Dear CloudTech Solutions Team,\n\nI am writing to express my strong interest in the DevOps Engineer position. With 4 years of experience in cloud infrastructure and extensive knowledge of AWS, Kubernetes, and Terraform, I am well-positioned to help manage your cloud infrastructure and CI/CD pipelines.\n\nIn my current role, I have successfully implemented Infrastructure as Code practices, managed container orchestration platforms, and optimized deployment pipelines for improved efficiency and reliability. I am excited about the opportunity to work with cutting-edge technologies in a remote environment.\n\nI look forward to discussing how my expertise can contribute to CloudTech Solutions' continued success.\n\nSincerely,\nAlice Johnson",
    "follow_up_date": null,
    "score": 92.3,
    "portal_response": "Interview scheduled for January 5th",
    "auto_applied": true,
    "notes": "Interview confirmed - prepare for technical questions"
  },
  {
    "id": 3,
    "user_id": 3,
    "job_id": 2,
    "status": "under_review",
    "applied_at": "2024-12-31T11:15:00Z",
    "updated_at": "2025-01-01T10:00:00Z",
    "cover_letter": "Dear DataFlow Analytics Team,\n\nI am thrilled to apply for the Data Scientist - Machine Learning position. With 3 years of experience in data science and machine learning, along with strong proficiency in Python, TensorFlow, and statistical analysis, I am excited about the opportunity to build cutting-edge ML models that drive business insights.\n\nMy background includes developing predictive models, working with large datasets, and implementing ML solutions in production environments. I am particularly interested in your focus on collaboration and the opportunity to work with cross-functional teams.\n\nI would be delighted to discuss how my passion for data science and technical skills can contribute to DataFlow Analytics' mission.\n\nBest regards,\nBob Chen",
    "follow_up_date": "2025-01-07T11:15:00Z",
    "score": 88.7,
    "portal_response": "Application received and under review",
    "auto_applied": false,
    "notes": "Good skill match - waiting for response"
  },
  {
    "id": 4,
    "user_id": 4,
    "job_id": 3,
    "status": "rejected",
    "applied_at": "2024-12-29T16:30:00Z",
    "updated_at": "2024-12-31T09:00:00Z",
    "cover_letter": "Dear Creative Designs Inc Team,\n\nI am excited to apply for the Frontend Developer - React position. As a passionate frontend developer with 1 year of experience and strong skills in React, JavaScript, and responsive design, I am eager to join your creative team and contribute to building beautiful web applications.\n\nDuring my experience, I have worked on various React projects, collaborated with designers using Figma, and focused on creating user-friendly interfaces. I am excited about the opportunity to grow my career in frontend development with your innovative team.\n\nThank you for considering my application. I look forward to the opportunity to discuss how I can contribute to Creative Designs Inc.\n\nSincerely,\nSarah Williams",
    "follow_up_date": null,
    "score": 76.2,
    "portal_response": "Thank you for your application. We have decided to move forward with other candidates.",
    "auto_applied": false,
    "notes": "Position filled - good learning experience"
  },
  {
    "id": 5,
    "user_id": 5,
    "job_id": 4,
    "status": "offer",
    "applied_at": "2024-12-30T14:00:00Z",
    "updated_at": "2025-01-01T16:45:00Z",
    "cover_letter": "Dear CloudTech Solutions Hiring Team,\n\nI am writing to express my interest in the DevOps Engineer - Cloud Infrastructure position. With 6 years of extensive experience in DevOps and Site Reliability Engineering, including deep expertise in AWS, Kubernetes, and Infrastructure as Code, I am confident in my ability to manage your cloud infrastructure and optimize your CI/CD pipelines.\n\nThroughout my career, I have successfully designed and implemented scalable cloud architectures, automated deployment processes, and ensured high availability and security across multiple environments. My experience with monitoring and logging tools has enabled me to maintain optimal system performance and quickly resolve issues.\n\nI am excited about the opportunity to work with CloudTech Solutions and contribute to your mission of delivering reliable, scalable cloud services.\n\nBest regards,\nMichael Rodriguez",
    "follow_up_date": null,
    "score": 96.1,
    "portal_response": "Congratulations! We would like to extend an offer. Please review the attached details.",
    "auto_applied": true,
    "notes": "Excellent match - offer received! Review terms"
  },
  {
    "id": 6,
    "user_id": 1,
    "job_id": 5,
    "status": "applied",
    "applied_at": "2025-01-01T12:15:00Z",
    "updated_at": "2025-01-01T12:15:00Z",
    "cover_letter": "Dear StartupHub Team,\n\nI am excited to apply for the Backend Developer - Python/Django position. With experience in Python and FastAPI, along with knowledge of microservices architecture and database design, I am eager to contribute to your fast-growing startup environment.\n\nI appreciate your focus on innovation, collaboration, and rapid iteration. My background in building scalable APIs and working in agile development environments aligns well with your startup culture and technical requirements.\n\nI look forward to the opportunity to discuss how I can contribute to StartupHub's continued growth and success.\n\nBest regards,\nDemo User",
    "follow_up_date": "2025-01-08T12:15:00Z",
    "score": 82.4,
    "portal_response": "Application submitted successfully",
    "auto_applied": false,
    "notes": "Startup opportunity - good for career growth"
  },
  {
    "id": 7,
    "user_id": 2,
    "job_id": 6,
    "status": "withdrawn",
    "applied_at": "2025-01-01T08:30:00Z",
    "updated_at": "2025-01-01T13:45:00Z",
    "cover_letter": "Dear MegaCorp Industries Team,\n\nI am writing to apply for the Junior Software Engineer position. While I have 4 years of experience, I am interested in this role as it offers opportunities to work on enterprise software solutions and learn from senior engineers in a large organization.\n\nMy experience with Java, Python, and software development principles would allow me to contribute effectively while continuing to grow my skills in an enterprise environment.\n\nThank you for your consideration.\n\nSincerely,\nAlice Johnson",
    "follow_up_date": null,
    "score": 68.9,
    "portal_response": "Application withdrawn by candidate",
    "auto_applied": true,
    "notes": "Overqualified - withdrew after further consideration"
  },
  {
    "id": 8,
    "user_id": 3,
    "job_id": 7,
    "status": "applied",
    "applied_at": "2024-12-28T10:20:00Z",
    "updated_at": "2024-12-28T10:20:00Z",
    "cover_letter": "Dear AI Innovations Lab Team,\n\nI am extremely excited to apply for the AI/ML Research Scientist position. While I have 3 years of experience in data science and machine learning, I am passionate about advancing into research and contributing to cutting-edge AI/ML innovations.\n\nMy experience with Python, TensorFlow, PyTorch, and various ML algorithms, combined with my strong mathematical background, positions me well to grow into this research role. I am particularly interested in your work on novel algorithms and translating research into practical applications.\n\nI would welcome the opportunity to discuss how my passion for AI/ML research and technical foundation can contribute to your team's groundbreaking work.\n\nBest regards,\nBob Chen",
    "follow_up_date": "2025-01-04T10:20:00Z",
    "score": 74.6,
    "portal_response": "Application submitted successfully",
    "auto_applied": false,
    "notes": "Stretch application - good for career advancement"
  },
  {
    "id": 9,
    "user_id": 4,
    "job_id": 8,
    "status": "applied",
    "applied_at": "2024-12-27T14:45:00Z",
    "updated_at": "2024-12-27T14:45:00Z",
    "cover_letter": "Dear AppCrafters Team,\n\nI am interested in the Mobile App Developer - React Native position. While my primary experience is in frontend web development with React, I am excited about the opportunity to transition into mobile development and apply my React knowledge to React Native.\n\nMy experience with React, JavaScript, and responsive design provides a strong foundation for mobile app development. I am eager to learn mobile-specific concepts and contribute to building consumer-facing applications.\n\nI look forward to discussing how my frontend skills and enthusiasm for mobile development can benefit AppCrafters.\n\nSincerely,\nSarah Williams",
    "follow_up_date": "2025-01-03T14:45:00Z",
    "score": 71.3,
    "portal_response": "Application submitted successfully",
    "auto_applied": false,
    "notes": "Career transition opportunity - mobile development"
  },
  {
    "id": 10,
    "user_id": 1,
    "job_id": 10,
    "status": "not_interested",
    "applied_at": null,
    "updated_at": "2024-12-25T16:30:00Z",
    "cover_letter": null,
    "follow_up_date": null,
    "score": 45.2,
    "portal_response": null,
    "auto_applied": false,
    "notes": "Not interested - outside preferred field"
  }
]
